{
    "educations": [
        {
            "id": "edu-1",
            "school": "University of Kansas",
            "degree": "Master of Science in Computer Science",
            "duration": "Aug 2023 - Dec 2025",
            "content": [
                "GPA: 3.78/4"
            ]
        },
        {
            "id": "edu-2",
            "school": "SRM University",
            "degree": "Bachelors in Computer Science with AI & ML specilization",
            "duration": "Jul 2019 - May 2023",
            "content": [
                "GPA: 8.8/10"
            ]
        }
    ],
    "experiences": [
        {
            "id": "exp-1",
            "company": "Boven Technologies",
            "position": "Data Analyst",
            "duration": "May 2022 - May 2023",
            "description": [
                "In this project, I collaborated closely with client product and risk teams to define their reporting requirements and deliver an end-to-end data solution. My role involved pulling and cleaning loan records from AWS Redshift and Amazon S3 using SQL and Python (Pandas), ensuring the datasets were both accurate and analysis-ready.",
                "To maintain data reliability, I designed and implemented data-quality checks, which significantly increased stakeholder confidence in the reporting process by reducing errors. With this foundation, I performed cohort, segmentation, and trend analyses on loan repayment records. These analyses uncovered that a specific customer segment exhibited a 12% higher default risk, which directly informed updates to the client’s risk policy.",
                "On the engineering side, I built batch data pipelines that ingested raw and semi-processed client data into Amazon S3 (data lake), enabling centralized storage and archival. I then designed transformations that curated datasets and loaded them into Amazon Redshift, supporting scalable analytics and much faster client reporting cycles.",
                "To make insights accessible, I developed Power BI dashboards (with DAX and data modeling) that connected directly to AWS Redshift and Athena. These dashboards reduced manual reporting efforts by 40% and gave executives near real-time visibility into loan approval KPIs."
            ]
        },
        {
            "id": "exp-2",
            "company": "SRM University",
            "position": "Research Assistant",
            "duration": "Jun 2022 - Dec 2022",
            "description": [
                "Worked on developing predictive models to forecast pavement distress on highways using real-time visual data. Leveraged camera systems to capture road surface conditions and applied machine learning techniques to analyze cracks, potholes, and other signs of degradation.​",
                "Combined visual analysis with contextual data such as traffic load and environmental factors to improve prediction accuracy. The goal was to enable early detection of distress and support proactive maintenance strategies, contributing to safer and more cost-effective infrastructure management."
            ]
        }
    ],
    "skills": [
        {
            "title": "Programming",
            "tools": [
                "Python",
                "C/C++",
                "SQL",
                "JavaScript"
            ]
        },
        {
            "title": "Core Concepts",
            "tools": [" Data Structures", " Algorithms", "Operating Systems", "DBMS", "MySQL"]
        },
        {
            "title": "Data Engineering & Visualization",
            "tools": ["AWS (Glue, Redshift, S3, EMR, Lambda, Kinesis)", "Hadoop", "PySpark", "Kafka", "Airflow", "Snowflake", "ETL Pipelines", "Power BI", "Excel", "Numpy", "Pandas"]
        },

        {
            "title": "Competencies",
            "tools": ["Data Analysis", "Data Engineering", "Data Visualization", "Data Modeling", "Data Pipelines", "Machine Learning", "Deep Learning", "Artificial Intelligence", "Data Warehousing"]
        }
    ],
    "blog": [
        {
            "id": "blog-1",
            "title": "",
            "link": ""
        },
        {
            "id": "blog-2",
            "title": "",
            "link": ""
        }
    ]
}
